* Store_R29
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Store_R29_BH18c
Place name                       | Store Glacier
Geographic location              | Central West Greenland
Ice type                         | Ice sheet
Data Source                      | Hubbard, Bryn; Christoffersen, Poul; Doyle, Samuel; Chudley, Thomas; Schoonman, Charlotte; Law, Robert; et al. (2020): Supporting data for 'Borehole-based characterization of deep crevasses at a Greenlandic outlet glacier' published in AGU Advances. figshare. Dataset. https://doi.org/10.6084/m9.figshare.13400072.v1
Data DOI                         | 10.6084/m9.figshare.13400072.v1
Science Source                   | Hubbard, B., Christoffersen, P., Doyle, S. H., Chudley, T. R., Bougamont, M. H., Law, R., & Schoonman, C. (2020). Borehole-based characterization of deep crevasses at a Greenlandic outlet glacier.
Science DOI                      | 10.1029/2020AV000291
Date                             | 2018-08
Longitude [°E]                   | -50.05894
Latitude [°N]                    | 70.56359
Location Source                  | S. Doyle email
Depth of top measurement [m]     | 25.0
Depth of bottom measurement [m]  | 949
Ice thickness [m]                | 949
Coverage [% of thickness]        | 97
Ice thickness source             | See science reference
Note                             | Note: Borehole 18c temperatures were actually measured in immediately adjacent Boreholes 18b and 18d.
#+end_example


** Temperature

** Thickness

From Doyle (2018), "Ice thickness at S30 was determined to be ∼600 m"

** Location

** Data                                                 :noexport:

#+BEGIN_SRC bash
wget https://figshare.com/ndownloader/files/25808072 -O 25808072.csv
#+END_SRC

#+BEGIN_SRC jupyter-python :exports none
import pandas as pd

df = pd.read_csv('25808072.csv')
df.to_csv('raw.csv')
df = df.rename(columns = {'Depth (m)':'d', 'Temperature (Deg. C)': 't'})
df = df.set_index('d').dropna(how='all')
df['t'].to_csv('data.csv', float_format='%.3f')
#+END_SRC

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|     d |     t |
|  25.0 |  -4.7 |
|  31.0 |  -5.9 |
| 100.0 | -12.4 |
| 105.0 | -12.9 |
| 113.0 | -13.1 |
| 174.0 | -12.8 |
| 180.0 | -13.5 |
| 187.0 | -13.9 |
| 251.0 | -14.8 |
| 256.0 | -15.6 |
| 262.0 | -16.4 |
| 328.0 | -17.9 |
| 337.0 | -18.9 |
| 401.0 | -19.8 |
| 412.0 | -20.3 |
| 477.0 | -20.2 |
| 484.0 | -21.6 |
| 499.0 | -20.1 |
| 552.0 | -20.9 |
| 559.0 | -21.7 |
| 574.0 | -20.6 |
| 634.0 | -21.5 |
| 649.0 | -19.6 |
| 709.0 | -19.4 |
| 724.0 | -16.0 |
| 784.0 |  -7.3 |
| 799.0 | -17.0 |
| 859.0 | -10.8 |
| 874.0 |  -9.2 |
| 934.0 |  -0.8 |
| 949.0 |  -1.0 |
